app/controllers/buddies_controller.rb

  def create
    @buddy = Buddy.new(buddy_params)

    @buddy.save
---
INSERT INTO "buddies" ("first_name", "last_name", "zipcode", "interest", "availability", "communication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @buddy = Buddy.find(params[:id])
---
SELECT  "buddies".* FROM "buddies" WHERE "buddies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]