app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)

    @member.save
---
INSERT INTO "members" ("first_name", "last_name", "zipcode", "interest", "availability", "communication", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)